In [30]:
import pandas as pd
import numpy as np
#from os import path

In [2]:
fname_temp = 'data/msc_traffic_1.csv'

In [3]:
!head "$fname_temp"

Date,MSC,Call Attempts,Call success,Call Answer,traffic,success rate,answer rate,mht
2015-01-10 00:00:00,MSC_1,1000,922,702,1198.92315835941,92.2210051939666,70.2274131211149,1.70786774695073
2015-01-10 01:00:00,MSC_1,993,899,728,775.09005237436,90.5273810076752,73.354132518539,1.06468413787687
2015-01-10 02:00:00,MSC_1,850,779,671,776.387333959399,91.6501401827553,78.9629424364571,1.15706011022265
2015-01-10 03:00:00,MSC_1,821,776,675,879.424597408871,94.4974116160334,82.2001557736036,1.30285125542055
2015-01-10 04:00:00,MSC_1,900,892,795,1424.72823774089,99.1413728169044,88.3327943083132,1.79211099086905
2015-01-10 05:00:00,MSC_1,943,886,842,1033.77539952557,93.9567555788461,89.2736079453603,1.22776175715626
2015-01-10 06:00:00,MSC_1,1102,1095,886,1346.88400016375,99.4022002025181,80.4218233485119,1.52018510176496
2015-01-10 07:00:00,MSC_1,1240,1127,919,1059.81720011154,90.8936945973918,74.1191410973239,1.15322872699841
2015-01-10 08:00:00,MSC_1,1851,1841,1406,1876.10871022632,99.4385880671418,75.9440943592534,1.33435896886651

In [4]:
pd_temp = pd.read_csv(fname_temp, index_col=False)
pd_temp.head()

,Date,MSC,Call Attempts,Call success,Call Answer,traffic,success rate,answer rate,mht
0,2015-01-10 00:00:00,MSC_1,1000,922,702,1198.923158,92.221005,70.227413,1.707868
1,2015-01-10 01:00:00,MSC_1,993,899,728,775.090052,90.527381,73.354133,1.064684
2,2015-01-10 02:00:00,MSC_1,850,779,671,776.387334,91.650140,78.962942,1.157060
3,2015-01-10 03:00:00,MSC_1,821,776,675,879.424597,94.497412,82.200156,1.302851
4,2015-01-10 04:00:00,MSC_1,900,892,795,1424.728238,99.141373,88.332794,1.792111

In [5]:
pd_temp.to_csv(path_or_buf='data/msc_traffic_0110.csv', columns=['Date', 'MSC', 'Call Attempts', 'Call success', 'Call Answer', 'traffic'], index=False)

In [6]:
df = pd.read_csv('data/msc_traffic_0110.csv')

In [7]:
!head "data/msc_traffic_0110.csv"

Date,MSC,Call Attempts,Call success,Call Answer,traffic
2015-01-10 00:00:00,MSC_1,1000,922,702,1198.9231583594099
2015-01-10 01:00:00,MSC_1,993,899,728,775.0900523743599
2015-01-10 02:00:00,MSC_1,850,779,671,776.3873339593989
2015-01-10 03:00:00,MSC_1,821,776,675,879.424597408871
2015-01-10 04:00:00,MSC_1,900,892,795,1424.7282377408899
2015-01-10 05:00:00,MSC_1,943,886,842,1033.7753995255698
2015-01-10 06:00:00,MSC_1,1102,1095,886,1346.88400016375
2015-01-10 07:00:00,MSC_1,1240,1127,919,1059.8172001115402
2015-01-10 08:00:00,MSC_1,1851,1841,1406,1876.1087102263198

In [8]:
df.head()

,Date,MSC,Call Attempts,Call success,Call Answer,traffic
0,2015-01-10 00:00:00,MSC_1,1000,922,702,1198.923158
1,2015-01-10 01:00:00,MSC_1,993,899,728,775.090052
2,2015-01-10 02:00:00,MSC_1,850,779,671,776.387334
3,2015-01-10 03:00:00,MSC_1,821,776,675,879.424597
4,2015-01-10 04:00:00,MSC_1,900,892,795,1424.728238

In [9]:
df.index

RangeIndex(start=0, stop=48, step=1)

In [10]:
df.columns

Index(['Date', 'MSC', 'Call Attempts', 'Call success', 'Call Answer',
       'traffic'],
      dtype='object')

In [11]:
df = pd.read_csv('data/msc_traffic_0110', index_col='Date')
df.head()

,MSC,Call Attempts,Call success,Call Answer,traffic
Date,,,,,
2015-01-10 00:00:00,MSC_1,1000,922,702,1198.923158
2015-01-10 01:00:00,MSC_1,993,899,728,775.090052
2015-01-10 02:00:00,MSC_1,850,779,671,776.387334
2015-01-10 03:00:00,MSC_1,821,776,675,879.424597
2015-01-10 04:00:00,MSC_1,900,892,795,1424.728238

In [12]:
df.columns

Index(['MSC', 'Call Attempts', 'Call success', 'Call Answer', 'traffic'], dtype='object')

In [13]:
df.index[0:2]

Index(['2015-01-10 00:00:00', '2015-01-10 01:00:00'], dtype='object', name='Date')

In [14]:
df.dtypes

MSC               object
Call Attempts      int64
Call success       int64
Call Answer        int64
traffic          float64
dtype: object

In [15]:
df = pd.read_csv('data/msc_traffic_0110', index_col='Date', parse_dates=['Date'])
df.index[0:2]

DatetimeIndex(['2015-01-10 00:00:00', '2015-01-10 01:00:00'], dtype='datetime64[ns]', name='Date', freq=None)

In [16]:
df['Call Attempts'][0:2]

Date
2015-01-10 00:00:00    1000
2015-01-10 01:00:00     993
Name: Call Attempts, dtype: int64

In [17]:
df.loc['2015-01-10 00:00:00']

              MSC  Call Attempts  Call success  Call Answer      traffic
Date
2015-01-10  MSC_1           1000           922          702  1198.923158
2015-01-10  MSC_2           1504          1399         1292  2580.083498

In [18]:
df.dtypes

MSC               object
Call Attempts      int64
Call success       int64
Call Answer        int64
traffic          float64
dtype: object

In [19]:
#pd.options.display.float_format = '{0:.2f}'.format
df['traffic'].sum()
#print('{0:.2f}'.format(a))

159941.1626508716

In [20]:
df.groupby(['MSC'])['traffic'].sum()

MSC
MSC_1    85296.429342
MSC_2    74644.733309
Name: traffic, dtype: float64

In [31]:
x = df['MSC']
np.unique(x.values)

array(['MSC_1', 'MSC_2'], dtype=object)

In [42]:
y=df.groupby(['MSC'])
y.nunique()

       MSC  Call Attempts  Call success  Call Answer  traffic
MSC
MSC_1    1             24            24           24       24
MSC_2    1             24            24           24       24

In [35]:
df.groupby(['MSC']).sum()

       Call Attempts  Call success  Call Answer       traffic
MSC
MSC_1          69975         66854        56048  85296.429342
MSC_2          60972         58046        47914  74644.733309